RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_pwmv2_regs.h
/* Bitfield definition for register of struct array PWM: CFG1 */
/*
 * HIGHZ_EN_N (RW)
 *
 * 0 to highz pwm outputs(pad_oe*=0), software need set this bit to 1 to enable pwm output
 */
#define PWMV2_PWM_CFG1_HIGHZ_EN_N_MASK (0x10000000UL)
#define PWMV2_PWM_CFG1_HIGHZ_EN_N_SHIFT (28U)
#define PWMV2_PWM_CFG1_HIGHZ_EN_N_SET(x) (((uint32_t)(x) << PWMV2_PWM_CFG1_HIGHZ_EN_N_SHIFT) & PWMV2_PWM_CFG1_HIGHZ_EN_N_MASK)
#define PWMV2_PWM_CFG1_HIGHZ_EN_N_GET(x) (((uint32_t)(x) & PWMV2_PWM_CFG1_HIGHZ_EN_N_MASK) >> PWMV2_PWM_CFG1_HIGHZ_EN_N_SHIFT)

/*
 * FORCE_UPDATE_TIME (RW)
 *
 * define when to use the shadow register value for working register(force_mode)
 * 00:  software set work_ctrl1.shadow_lock bit
 * 01:  use the related counter rld_cmp_sel0 and rld_cmp_sel1, to select one compare point
 * 10:  related counter reload time(selected by pwm_cnt)
 * 11:  use force_trig_sel to select one of the input trigger
 * NOTE: 00/01 are not recommended since the update time is not controllable, may cause error in complex application.
 * 00 is used for initialization or debug, not suggest for real time update
 */
#define PWMV2_PWM_CFG1_FORCE_UPDATE_TIME_MASK (0xC000000UL)
#define PWMV2_PWM_CFG1_FORCE_UPDATE_TIME_SHIFT (26U)
#define PWMV2_PWM_CFG1_FORCE_UPDATE_TIME_SET(x) (((uint32_t)(x) << PWMV2_PWM_CFG1_FORCE_UPDATE_TIME_SHIFT) & PWMV2_PWM_CFG1_FORCE_UPDATE_TIME_MASK)
#define PWMV2_PWM_CFG1_FORCE_UPDATE_TIME_GET(x) (((uint32_t)(x) & PWMV2_PWM_CFG1_FORCE_UPDATE_TIME_MASK) >> PWMV2_PWM_CFG1_FORCE_UPDATE_TIME_SHIFT)

/*
 * FAULT_MODE (RW)
 *
 * 00:  force output 0
 * 01:  force output 1
 * 1x:  output highz(pad_oe_*=0)
 */
#define PWMV2_PWM_CFG1_FAULT_MODE_MASK (0x3000000UL)
#define PWMV2_PWM_CFG1_FAULT_MODE_SHIFT (24U)
#define PWMV2_PWM_CFG1_FAULT_MODE_SET(x) (((uint32_t)(x) << PWMV2_PWM_CFG1_FAULT_MODE_SHIFT) & PWMV2_PWM_CFG1_FAULT_MODE_MASK)
#define PWMV2_PWM_CFG1_FAULT_MODE_GET(x) (((uint32_t)(x) & PWMV2_PWM_CFG1_FAULT_MODE_MASK) >> PWMV2_PWM_CFG1_FAULT_MODE_SHIFT)

/*
 * FAULT_REC_TIME (RW)
 *
 * 00:  immediately
 * 01:  after main counter reload time
 * 10:  use fault_rec_sel to select one of the input trigger
 * 11:  software write fault_clear in glb_ctrl2, no effort if pwm_fault is still assert
 */
#define PWMV2_PWM_CFG1_FAULT_REC_TIME_MASK (0xC00000UL)
#define PWMV2_PWM_CFG1_FAULT_REC_TIME_SHIFT (22U)
#define PWMV2_PWM_CFG1_FAULT_REC_TIME_SET(x) (((uint32_t)(x) << PWMV2_PWM_CFG1_FAULT_REC_TIME_SHIFT) & PWMV2_PWM_CFG1_FAULT_REC_TIME_MASK)
#define PWMV2_PWM_CFG1_FAULT_REC_TIME_GET(x) (((uint32_t)(x) & PWMV2_PWM_CFG1_FAULT_REC_TIME_MASK) >> PWMV2_PWM_CFG1_FAULT_REC_TIME_SHIFT)

/*
 * SW_FORCE_EN (RW)
 *
 * 0 for hardware force, from trig_mux selected by pwm_force_sel
 * 1 for software force, from glb_ctrl.sw_force
 */
#define PWMV2_PWM_CFG1_SW_FORCE_EN_MASK (0x200000UL)
#define PWMV2_PWM_CFG1_SW_FORCE_EN_SHIFT (21U)
#define PWMV2_PWM_CFG1_SW_FORCE_EN_SET(x) (((uint32_t)(x) << PWMV2_PWM_CFG1_SW_FORCE_EN_SHIFT) & PWMV2_PWM_CFG1_SW_FORCE_EN_MASK)
#define PWMV2_PWM_CFG1_SW_FORCE_EN_GET(x) (((uint32_t)(x) & PWMV2_PWM_CFG1_SW_FORCE_EN_MASK) >> PWMV2_PWM_CFG1_SW_FORCE_EN_SHIFT)

/*
 * PAIR_MODE (RW)
 *
 * if set to 1, PWM work at pair mode,
 * pwm_cfg for channel 2m is used for channel 2m+1(m=0,1,2,3),
 * except the dead area, which is separate for each channel even in pair mode
 * software need set this bit for both channel of one pair, otherwise result unknown.
 */
#define PWMV2_PWM_CFG1_PAIR_MODE_MASK (0x100000UL)
#define PWMV2_PWM_CFG1_PAIR_MODE_SHIFT (20U)
#define PWMV2_PWM_CFG1_PAIR_MODE_SET(x) (((uint32_t)(x) << PWMV2_PWM_CFG1_PAIR_MODE_SHIFT) & PWMV2_PWM_CFG1_PAIR_MODE_MASK)
#define PWMV2_PWM_CFG1_PAIR_MODE_GET(x) (((uint32_t)(x) & PWMV2_PWM_CFG1_PAIR_MODE_MASK) >> PWMV2_PWM_CFG1_PAIR_MODE_SHIFT)

/*
 * PWM_LOGIC (RW)
 *
 * valid only for pwm0/2/4/6 when trig_sel4 is set
 * 00:  ab OR cd;
 * 01:  ab AND cd;
 * 10:  ab XOR cd;
 * 11:  cd
 */
#define PWMV2_PWM_CFG1_PWM_LOGIC_MASK (0xC0000UL)
#define PWMV2_PWM_CFG1_PWM_LOGIC_SHIFT (18U)
#define PWMV2_PWM_CFG1_PWM_LOGIC_SET(x) (((uint32_t)(x) << PWMV2_PWM_CFG1_PWM_LOGIC_SHIFT) & PWMV2_PWM_CFG1_PWM_LOGIC_MASK)
#define PWMV2_PWM_CFG1_PWM_LOGIC_GET(x) (((uint32_t)(x) & PWMV2_PWM_CFG1_PWM_LOGIC_MASK) >> PWMV2_PWM_CFG1_PWM_LOGIC_SHIFT)

/*
 * FORCE_TIME (RW)
 *
 * 00:  force immediately
 * 01:  force at main counter reload time
 * 10:  force at trig signal selected by force_act_sel
 * 11: no force
 * the force assert/deassert will happen at the force_time;
 * qeo force and value also latched at this time
 */
#define PWMV2_PWM_CFG1_FORCE_TIME_MASK (0x30000UL)
#define PWMV2_PWM_CFG1_FORCE_TIME_SHIFT (16U)
#define PWMV2_PWM_CFG1_FORCE_TIME_SET(x) (((uint32_t)(x) << PWMV2_PWM_CFG1_FORCE_TIME_SHIFT) & PWMV2_PWM_CFG1_FORCE_TIME_MASK)
#define PWMV2_PWM_CFG1_FORCE_TIME_GET(x) (((uint32_t)(x) & PWMV2_PWM_CFG1_FORCE_TIME_MASK) >> PWMV2_PWM_CFG1_FORCE_TIME_SHIFT)

/*
 * FORCE_TRIG_SEL (RW)
 *
 * select one trigger from 8, should set to pulse in trig_mux, will load shadow register(force)mode) to force_mode_work at this time
 */
#define PWMV2_PWM_CFG1_FORCE_TRIG_SEL_MASK (0x7000U)
#define PWMV2_PWM_CFG1_FORCE_TRIG_SEL_SHIFT (12U)
#define PWMV2_PWM_CFG1_FORCE_TRIG_SEL_SET(x) (((uint32_t)(x) << PWMV2_PWM_CFG1_FORCE_TRIG_SEL_SHIFT) & PWMV2_PWM_CFG1_FORCE_TRIG_SEL_MASK)
#define PWMV2_PWM_CFG1_FORCE_TRIG_SEL_GET(x) (((uint32_t)(x) & PWMV2_PWM_CFG1_FORCE_TRIG_SEL_MASK) >> PWMV2_PWM_CFG1_FORCE_TRIG_SEL_SHIFT)

/*
 * FORCE_ACT_SEL (RW)
 *
 * select one trigger from 8, should set to pulse in trig_mux, will load hw/sw force at this time
 */
#define PWMV2_PWM_CFG1_FORCE_ACT_SEL_MASK (0x700U)
#define PWMV2_PWM_CFG1_FORCE_ACT_SEL_SHIFT (8U)
#define PWMV2_PWM_CFG1_FORCE_ACT_SEL_SET(x) (((uint32_t)(x) << PWMV2_PWM_CFG1_FORCE_ACT_SEL_SHIFT) & PWMV2_PWM_CFG1_FORCE_ACT_SEL_MASK)
#define PWMV2_PWM_CFG1_FORCE_ACT_SEL_GET(x) (((uint32_t)(x) & PWMV2_PWM_CFG1_FORCE_ACT_SEL_MASK) >> PWMV2_PWM_CFG1_FORCE_ACT_SEL_SHIFT)

/*
 * PWM_FORCE_SEL (RW)
 *
 * select one trigger from 8 as force signal, should be level signal, 1 for force active, 0 for no force
 */
#define PWMV2_PWM_CFG1_PWM_FORCE_SEL_MASK (0x70U)
#define PWMV2_PWM_CFG1_PWM_FORCE_SEL_SHIFT (4U)
#define PWMV2_PWM_CFG1_PWM_FORCE_SEL_SET(x) (((uint32_t)(x) << PWMV2_PWM_CFG1_PWM_FORCE_SEL_SHIFT) & PWMV2_PWM_CFG1_PWM_FORCE_SEL_MASK)
#define PWMV2_PWM_CFG1_PWM_FORCE_SEL_GET(x) (((uint32_t)(x) & PWMV2_PWM_CFG1_PWM_FORCE_SEL_MASK) >> PWMV2_PWM_CFG1_PWM_FORCE_SEL_SHIFT)

