RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_pwmv2_regs.h
/*
 * FORCE_MODE (RO)
 *
 * force_mode work register
 */
#define PWMV2_FORCE_WORK_FORCE_MODE_MASK (0xFFFFU)
#define PWMV2_FORCE_WORK_FORCE_MODE_SHIFT (0U)
#define PWMV2_FORCE_WORK_FORCE_MODE_GET(x) (((uint32_t)(x) & PWMV2_FORCE_WORK_FORCE_MODE_MASK) >> PWMV2_FORCE_WORK_FORCE_MODE_SHIFT)

/* Bitfield definition for register array: CNT_VAL */
/*
 * VALUE (RO)
 *
 * main counter value
 */
#define PWMV2_CNT_VAL_VALUE_MASK (0xFFFFFFFFUL)
#define PWMV2_CNT_VAL_VALUE_SHIFT (0U)
#define PWMV2_CNT_VAL_VALUE_GET(x) (((uint32_t)(x) & PWMV2_CNT_VAL_VALUE_MASK) >> PWMV2_CNT_VAL_VALUE_SHIFT)

/* Bitfield definition for register array: DAC_VALUE_SV */
/*
 * VALUE (RW)
 *
 * save dac0_value when dac0_valid if dac_sw_mode is 0;
 * software write dac_value directly if dac_sw_mode is 1
 */
#define PWMV2_DAC_VALUE_SV_VALUE_MASK (0xFFFFFFFFUL)
#define PWMV2_DAC_VALUE_SV_VALUE_SHIFT (0U)
#define PWMV2_DAC_VALUE_SV_VALUE_SET(x) (((uint32_t)(x) << PWMV2_DAC_VALUE_SV_VALUE_SHIFT) & PWMV2_DAC_VALUE_SV_VALUE_MASK)
#define PWMV2_DAC_VALUE_SV_VALUE_GET(x) (((uint32_t)(x) & PWMV2_DAC_VALUE_SV_VALUE_MASK) >> PWMV2_DAC_VALUE_SV_VALUE_SHIFT)

/* Bitfield definition for register array: CAPTURE_POS */
/*
 * CAPTURE_POS (RO)
 *
 * related counter value captured at input negedge
 */
#define PWMV2_CAPTURE_POS_CAPTURE_POS_MASK (0xFFFFFF00UL)
#define PWMV2_CAPTURE_POS_CAPTURE_POS_SHIFT (8U)
#define PWMV2_CAPTURE_POS_CAPTURE_POS_GET(x) (((uint32_t)(x) & PWMV2_CAPTURE_POS_CAPTURE_POS_MASK) >> PWMV2_CAPTURE_POS_CAPTURE_POS_SHIFT)

/*
 * CAPTURE_SELGPIO (RW)
 *
 * 0: result from CAP[  7:0],  from trgm
 * 1: result from CAP[15:8],  from gpio
 */
#define PWMV2_CAPTURE_POS_CAPTURE_SELGPIO_MASK (0x10U)
#define PWMV2_CAPTURE_POS_CAPTURE_SELGPIO_SHIFT (4U)
#define PWMV2_CAPTURE_POS_CAPTURE_SELGPIO_SET(x) (((uint32_t)(x) << PWMV2_CAPTURE_POS_CAPTURE_SELGPIO_SHIFT) & PWMV2_CAPTURE_POS_CAPTURE_SELGPIO_MASK)
#define PWMV2_CAPTURE_POS_CAPTURE_SELGPIO_GET(x) (((uint32_t)(x) & PWMV2_CAPTURE_POS_CAPTURE_SELGPIO_MASK) >> PWMV2_CAPTURE_POS_CAPTURE_SELGPIO_SHIFT)

/*
 * CNT_INDEX (RW)
 *
 * related counter
 */
#define PWMV2_CAPTURE_POS_CNT_INDEX_MASK (0x3U)
#define PWMV2_CAPTURE_POS_CNT_INDEX_SHIFT (0U)
#define PWMV2_CAPTURE_POS_CNT_INDEX_SET(x) (((uint32_t)(x) << PWMV2_CAPTURE_POS_CNT_INDEX_SHIFT) & PWMV2_CAPTURE_POS_CNT_INDEX_MASK)
#define PWMV2_CAPTURE_POS_CNT_INDEX_GET(x) (((uint32_t)(x) & PWMV2_CAPTURE_POS_CNT_INDEX_MASK) >> PWMV2_CAPTURE_POS_CNT_INDEX_SHIFT)

/* Bitfield definition for register array: CAPTURE_NEG */
/*
 * CAPTURE_NEG (RO)
 *
 * counter value captured at input negedge
 */
#define PWMV2_CAPTURE_NEG_CAPTURE_NEG_MASK (0xFFFFFF00UL)
#define PWMV2_CAPTURE_NEG_CAPTURE_NEG_SHIFT (8U)
#define PWMV2_CAPTURE_NEG_CAPTURE_NEG_GET(x) (((uint32_t)(x) & PWMV2_CAPTURE_NEG_CAPTURE_NEG_MASK) >> PWMV2_CAPTURE_NEG_CAPTURE_NEG_SHIFT)

/* Bitfield definition for register: IRQ_STS */
/*
 * IRQ_CAL_OVERFLOW (W1C)
 *
 * end of output burst
 */
#define PWMV2_IRQ_STS_IRQ_CAL_OVERFLOW_MASK (0x80000000UL)
#define PWMV2_IRQ_STS_IRQ_CAL_OVERFLOW_SHIFT (31U)
#define PWMV2_IRQ_STS_IRQ_CAL_OVERFLOW_SET(x) (((uint32_t)(x) << PWMV2_IRQ_STS_IRQ_CAL_OVERFLOW_SHIFT) & PWMV2_IRQ_STS_IRQ_CAL_OVERFLOW_MASK)
#define PWMV2_IRQ_STS_IRQ_CAL_OVERFLOW_GET(x) (((uint32_t)(x) & PWMV2_IRQ_STS_IRQ_CAL_OVERFLOW_MASK) >> PWMV2_IRQ_STS_IRQ_CAL_OVERFLOW_SHIFT)

/*
 * IRQ_BURSTEND (RO)
 *
 * end of output burst
 */
#define PWMV2_IRQ_STS_IRQ_BURSTEND_MASK (0x20U)
#define PWMV2_IRQ_STS_IRQ_BURSTEND_SHIFT (5U)
#define PWMV2_IRQ_STS_IRQ_BURSTEND_GET(x) (((uint32_t)(x) & PWMV2_IRQ_STS_IRQ_BURSTEND_MASK) >> PWMV2_IRQ_STS_IRQ_BURSTEND_SHIFT)

/*
 * IRQ_FAULT (RO)
 *
 * for external fault event
 */
#define PWMV2_IRQ_STS_IRQ_FAULT_MASK (0x10U)
#define PWMV2_IRQ_STS_IRQ_FAULT_SHIFT (4U)
#define PWMV2_IRQ_STS_IRQ_FAULT_GET(x) (((uint32_t)(x) & PWMV2_IRQ_STS_IRQ_FAULT_MASK) >> PWMV2_IRQ_STS_IRQ_FAULT_SHIFT)

/*
 * IRQ_CAPTURE_NEG (RO)
 *
 * capture negedge status
 */
#define PWMV2_IRQ_STS_IRQ_CAPTURE_NEG_MASK (0x8U)
#define PWMV2_IRQ_STS_IRQ_CAPTURE_NEG_SHIFT (3U)
#define PWMV2_IRQ_STS_IRQ_CAPTURE_NEG_GET(x) (((uint32_t)(x) & PWMV2_IRQ_STS_IRQ_CAPTURE_NEG_MASK) >> PWMV2_IRQ_STS_IRQ_CAPTURE_NEG_SHIFT)

/*
 * IRQ_CAPTURE_POS (RO)
 *
 * capture posedge status
 */
#define PWMV2_IRQ_STS_IRQ_CAPTURE_POS_MASK (0x4U)
#define PWMV2_IRQ_STS_IRQ_CAPTURE_POS_SHIFT (2U)
#define PWMV2_IRQ_STS_IRQ_CAPTURE_POS_GET(x) (((uint32_t)(x) & PWMV2_IRQ_STS_IRQ_CAPTURE_POS_MASK) >> PWMV2_IRQ_STS_IRQ_CAPTURE_POS_SHIFT)

/*
 * IRQ_RELOAD (RO)
 *
 * when clock counter reach the reload time
 */
#define PWMV2_IRQ_STS_IRQ_RELOAD_MASK (0x2U)
#define PWMV2_IRQ_STS_IRQ_RELOAD_SHIFT (1U)
#define PWMV2_IRQ_STS_IRQ_RELOAD_GET(x) (((uint32_t)(x) & PWMV2_IRQ_STS_IRQ_RELOAD_MASK) >> PWMV2_IRQ_STS_IRQ_RELOAD_SHIFT)

/*
 * IRQ_CMP (RO)
 *
 * for 24 channel, compare event
 */
#define PWMV2_IRQ_STS_IRQ_CMP_MASK (0x1U)
#define PWMV2_IRQ_STS_IRQ_CMP_SHIFT (0U)
#define PWMV2_IRQ_STS_IRQ_CMP_GET(x) (((uint32_t)(x) & PWMV2_IRQ_STS_IRQ_CMP_MASK) >> PWMV2_IRQ_STS_IRQ_CMP_SHIFT)

/* Bitfield definition for register: IRQ_EN */
/*
 * IRQ_EN_OVERFLOW (RW)
 *
 * enable interrupt when calculation unit overflow
 */
#define PWMV2_IRQ_EN_IRQ_EN_OVERFLOW_MASK (0x80000000UL)
#define PWMV2_IRQ_EN_IRQ_EN_OVERFLOW_SHIFT (31U)
#define PWMV2_IRQ_EN_IRQ_EN_OVERFLOW_SET(x) (((uint32_t)(x) << PWMV2_IRQ_EN_IRQ_EN_OVERFLOW_SHIFT) & PWMV2_IRQ_EN_IRQ_EN_OVERFLOW_MASK)
#define PWMV2_IRQ_EN_IRQ_EN_OVERFLOW_GET(x) (((uint32_t)(x) & PWMV2_IRQ_EN_IRQ_EN_OVERFLOW_MASK) >> PWMV2_IRQ_EN_IRQ_EN_OVERFLOW_SHIFT)

/* Bitfield definition for register: IRQ_STS_CMP */
/*
 * IRQ_STS_CMP (W1C)
 *
 * interrupt flag for compare point match event, and each bit means one compare point.
 */
#define PWMV2_IRQ_STS_CMP_IRQ_STS_CMP_MASK (0xFFFFFFUL)
#define PWMV2_IRQ_STS_CMP_IRQ_STS_CMP_SHIFT (0U)
#define PWMV2_IRQ_STS_CMP_IRQ_STS_CMP_SET(x) (((uint32_t)(x) << PWMV2_IRQ_STS_CMP_IRQ_STS_CMP_SHIFT) & PWMV2_IRQ_STS_CMP_IRQ_STS_CMP_MASK)
#define PWMV2_IRQ_STS_CMP_IRQ_STS_CMP_GET(x) (((uint32_t)(x) & PWMV2_IRQ_STS_CMP_IRQ_STS_CMP_MASK) >> PWMV2_IRQ_STS_CMP_IRQ_STS_CMP_SHIFT)

/* Bitfield definition for register: IRQ_STS_RELOAD */
/*
 * IRQ_STS_RELOAD (W1C)
 *
 * interrupt flag for reload event , and each bit means one main counter.
 */
#define PWMV2_IRQ_STS_RELOAD_IRQ_STS_RELOAD_MASK (0xFU)
#define PWMV2_IRQ_STS_RELOAD_IRQ_STS_RELOAD_SHIFT (0U)
#define PWMV2_IRQ_STS_RELOAD_IRQ_STS_RELOAD_SET(x) (((uint32_t)(x) << PWMV2_IRQ_STS_RELOAD_IRQ_STS_RELOAD_SHIFT) & PWMV2_IRQ_STS_RELOAD_IRQ_STS_RELOAD_MASK)
#define PWMV2_IRQ_STS_RELOAD_IRQ_STS_RELOAD_GET(x) (((uint32_t)(x) & PWMV2_IRQ_STS_RELOAD_IRQ_STS_RELOAD_MASK) >> PWMV2_IRQ_STS_RELOAD_IRQ_STS_RELOAD_SHIFT)

/* Bitfield definition for register: IRQ_STS_CAP_POS */
/*
 * IRQ_STS_CAP_POS (W1C)
 *
 * interrupt flag for posedge capture event , and each bit means one capture channel.
 */
#define PWMV2_IRQ_STS_CAP_POS_IRQ_STS_CAP_POS_MASK (0xFFU)
#define PWMV2_IRQ_STS_CAP_POS_IRQ_STS_CAP_POS_SHIFT (0U)
#define PWMV2_IRQ_STS_CAP_POS_IRQ_STS_CAP_POS_SET(x) (((uint32_t)(x) << PWMV2_IRQ_STS_CAP_POS_IRQ_STS_CAP_POS_SHIFT) & PWMV2_IRQ_STS_CAP_POS_IRQ_STS_CAP_POS_MASK)
#define PWMV2_IRQ_STS_CAP_POS_IRQ_STS_CAP_POS_GET(x) (((uint32_t)(x) & PWMV2_IRQ_STS_CAP_POS_IRQ_STS_CAP_POS_MASK) >> PWMV2_IRQ_STS_CAP_POS_IRQ_STS_CAP_POS_SHIFT)

/* Bitfield definition for register: IRQ_STS_CAP_NEG */
/*
 * IRQ_STS_CAP_NEG (W1C)
 *
 * interrupt flag for negedge capture event , and each bit means one capture channel.
 */
#define PWMV2_IRQ_STS_CAP_NEG_IRQ_STS_CAP_NEG_MASK (0xFFU)
#define PWMV2_IRQ_STS_CAP_NEG_IRQ_STS_CAP_NEG_SHIFT (0U)
#define PWMV2_IRQ_STS_CAP_NEG_IRQ_STS_CAP_NEG_SET(x) (((uint32_t)(x) << PWMV2_IRQ_STS_CAP_NEG_IRQ_STS_CAP_NEG_SHIFT) & PWMV2_IRQ_STS_CAP_NEG_IRQ_STS_CAP_NEG_MASK)
#define PWMV2_IRQ_STS_CAP_NEG_IRQ_STS_CAP_NEG_GET(x) (((uint32_t)(x) & PWMV2_IRQ_STS_CAP_NEG_IRQ_STS_CAP_NEG_MASK) >> PWMV2_IRQ_STS_CAP_NEG_IRQ_STS_CAP_NEG_SHIFT)

/* Bitfield definition for register: IRQ_STS_FAULT */
/*
 * IRQ_STS_FAULT (W1C)
 *
 * interrupt flag for external fault event , and each bit means one external fault channel.
 */
#define PWMV2_IRQ_STS_FAULT_IRQ_STS_FAULT_MASK (0xFFU)
#define PWMV2_IRQ_STS_FAULT_IRQ_STS_FAULT_SHIFT (0U)
#define PWMV2_IRQ_STS_FAULT_IRQ_STS_FAULT_SET(x) (((uint32_t)(x) << PWMV2_IRQ_STS_FAULT_IRQ_STS_FAULT_SHIFT) & PWMV2_IRQ_STS_FAULT_IRQ_STS_FAULT_MASK)
#define PWMV2_IRQ_STS_FAULT_IRQ_STS_FAULT_GET(x) (((uint32_t)(x) & PWMV2_IRQ_STS_FAULT_IRQ_STS_FAULT_MASK) >> PWMV2_IRQ_STS_FAULT_IRQ_STS_FAULT_SHIFT)

/* Bitfield definition for register: IRQ_STS_BURSTEND */
/*
 * IRQ_STS_BURSTEND (W1C)
 *
 * interrupt flag for output burst done event , and each bit means one main counter.
 */
#define PWMV2_IRQ_STS_BURSTEND_IRQ_STS_BURSTEND_MASK (0xFU)
#define PWMV2_IRQ_STS_BURSTEND_IRQ_STS_BURSTEND_SHIFT (0U)
#define PWMV2_IRQ_STS_BURSTEND_IRQ_STS_BURSTEND_SET(x) (((uint32_t)(x) << PWMV2_IRQ_STS_BURSTEND_IRQ_STS_BURSTEND_SHIFT) & PWMV2_IRQ_STS_BURSTEND_IRQ_STS_BURSTEND_MASK)
#define PWMV2_IRQ_STS_BURSTEND_IRQ_STS_BURSTEND_GET(x) (((uint32_t)(x) & PWMV2_IRQ_STS_BURSTEND_IRQ_STS_BURSTEND_MASK) >> PWMV2_IRQ_STS_BURSTEND_IRQ_STS_BURSTEND_SHIFT)

/* Bitfield definition for register: IRQ_EN_CMP */
/*
 * IRQ_EN_CMP (RW)
 *
 * interrupt enable field for compare point match event, and each bit means one compare point.
 */
#define PWMV2_IRQ_EN_CMP_IRQ_EN_CMP_MASK (0xFFFFFFUL)
#define PWMV2_IRQ_EN_CMP_IRQ_EN_CMP_SHIFT (0U)
#define PWMV2_IRQ_EN_CMP_IRQ_EN_CMP_SET(x) (((uint32_t)(x) << PWMV2_IRQ_EN_CMP_IRQ_EN_CMP_SHIFT) & PWMV2_IRQ_EN_CMP_IRQ_EN_CMP_MASK)
#define PWMV2_IRQ_EN_CMP_IRQ_EN_CMP_GET(x) (((uint32_t)(x) & PWMV2_IRQ_EN_CMP_IRQ_EN_CMP_MASK) >> PWMV2_IRQ_EN_CMP_IRQ_EN_CMP_SHIFT)

/* Bitfield definition for register: IRQ_EN_RELOAD */
/*
 * IRQ_EN_RELOAD (RW)
 *
 * interrupt enable field for reload event , and each bit means one main counter.
 */
#define PWMV2_IRQ_EN_RELOAD_IRQ_EN_RELOAD_MASK (0xFU)
#define PWMV2_IRQ_EN_RELOAD_IRQ_EN_RELOAD_SHIFT (0U)
#define PWMV2_IRQ_EN_RELOAD_IRQ_EN_RELOAD_SET(x) (((uint32_t)(x) << PWMV2_IRQ_EN_RELOAD_IRQ_EN_RELOAD_SHIFT) & PWMV2_IRQ_EN_RELOAD_IRQ_EN_RELOAD_MASK)
#define PWMV2_IRQ_EN_RELOAD_IRQ_EN_RELOAD_GET(x) (((uint32_t)(x) & PWMV2_IRQ_EN_RELOAD_IRQ_EN_RELOAD_MASK) >> PWMV2_IRQ_EN_RELOAD_IRQ_EN_RELOAD_SHIFT)

/* Bitfield definition for register: IRQ_EN_CAP_POS */
/*
 * IRQ_EN_CAP_POS (RW)
 *
 * interrupt enable field for posedge capture event , and each bit means one capture channel.
 */
#define PWMV2_IRQ_EN_CAP_POS_IRQ_EN_CAP_POS_MASK (0xFFU)
#define PWMV2_IRQ_EN_CAP_POS_IRQ_EN_CAP_POS_SHIFT (0U)
#define PWMV2_IRQ_EN_CAP_POS_IRQ_EN_CAP_POS_SET(x) (((uint32_t)(x) << PWMV2_IRQ_EN_CAP_POS_IRQ_EN_CAP_POS_SHIFT) & PWMV2_IRQ_EN_CAP_POS_IRQ_EN_CAP_POS_MASK)
#define PWMV2_IRQ_EN_CAP_POS_IRQ_EN_CAP_POS_GET(x) (((uint32_t)(x) & PWMV2_IRQ_EN_CAP_POS_IRQ_EN_CAP_POS_MASK) >> PWMV2_IRQ_EN_CAP_POS_IRQ_EN_CAP_POS_SHIFT)

/* Bitfield definition for register: IRQ_EN_CAP_NEG */
/*
 * IRQ_EN_CAP_NEG (RW)
 *
 * interrupt enable field for negedge capture event , and each bit means one capture channel.
 */
#define PWMV2_IRQ_EN_CAP_NEG_IRQ_EN_CAP_NEG_MASK (0xFFU)
#define PWMV2_IRQ_EN_CAP_NEG_IRQ_EN_CAP_NEG_SHIFT (0U)
#define PWMV2_IRQ_EN_CAP_NEG_IRQ_EN_CAP_NEG_SET(x) (((uint32_t)(x) << PWMV2_IRQ_EN_CAP_NEG_IRQ_EN_CAP_NEG_SHIFT) & PWMV2_IRQ_EN_CAP_NEG_IRQ_EN_CAP_NEG_MASK)
#define PWMV2_IRQ_EN_CAP_NEG_IRQ_EN_CAP_NEG_GET(x) (((uint32_t)(x) & PWMV2_IRQ_EN_CAP_NEG_IRQ_EN_CAP_NEG_MASK) >> PWMV2_IRQ_EN_CAP_NEG_IRQ_EN_CAP_NEG_SHIFT)

/* Bitfield definition for register: IRQ_EN_FAULT */
/*
 * IRQ_EN_FAULT (RW)
 *
 * interrupt enable field for external fault event , and each bit means one external fault channel.
 */
#define PWMV2_IRQ_EN_FAULT_IRQ_EN_FAULT_MASK (0xFFU)
#define PWMV2_IRQ_EN_FAULT_IRQ_EN_FAULT_SHIFT (0U)
#define PWMV2_IRQ_EN_FAULT_IRQ_EN_FAULT_SET(x) (((uint32_t)(x) << PWMV2_IRQ_EN_FAULT_IRQ_EN_FAULT_SHIFT) & PWMV2_IRQ_EN_FAULT_IRQ_EN_FAULT_MASK)
#define PWMV2_IRQ_EN_FAULT_IRQ_EN_FAULT_GET(x) (((uint32_t)(x) & PWMV2_IRQ_EN_FAULT_IRQ_EN_FAULT_MASK) >> PWMV2_IRQ_EN_FAULT_IRQ_EN_FAULT_SHIFT)

