RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_pwmv2_regs.h
/* Bitfield definition for register: IRQ_EN_BURSTEND */
/*
 * IRQ_EN_BURSTEND (RW)
 *
 * interrupt enable field for output burst done event , and each bit means one main counter.
 */
#define PWMV2_IRQ_EN_BURSTEND_IRQ_EN_BURSTEND_MASK (0xFU)
#define PWMV2_IRQ_EN_BURSTEND_IRQ_EN_BURSTEND_SHIFT (0U)
#define PWMV2_IRQ_EN_BURSTEND_IRQ_EN_BURSTEND_SET(x) (((uint32_t)(x) << PWMV2_IRQ_EN_BURSTEND_IRQ_EN_BURSTEND_SHIFT) & PWMV2_IRQ_EN_BURSTEND_IRQ_EN_BURSTEND_MASK)
#define PWMV2_IRQ_EN_BURSTEND_IRQ_EN_BURSTEND_GET(x) (((uint32_t)(x) & PWMV2_IRQ_EN_BURSTEND_IRQ_EN_BURSTEND_MASK) >> PWMV2_IRQ_EN_BURSTEND_IRQ_EN_BURSTEND_SHIFT)

/* Bitfield definition for register: DMA_EN */
/*
 * DMA3_EN (RW)
 *
 * enable dma3
 */
#define PWMV2_DMA_EN_DMA3_EN_MASK (0x80000000UL)
#define PWMV2_DMA_EN_DMA3_EN_SHIFT (31U)
#define PWMV2_DMA_EN_DMA3_EN_SET(x) (((uint32_t)(x) << PWMV2_DMA_EN_DMA3_EN_SHIFT) & PWMV2_DMA_EN_DMA3_EN_MASK)
#define PWMV2_DMA_EN_DMA3_EN_GET(x) (((uint32_t)(x) & PWMV2_DMA_EN_DMA3_EN_MASK) >> PWMV2_DMA_EN_DMA3_EN_SHIFT)

/*
 * DMA3_SEL (RW)
 *
 * selelct one of compare point(0~23) or one reload point(24~27) as dma0
 */
#define PWMV2_DMA_EN_DMA3_SEL_MASK (0x1F000000UL)
#define PWMV2_DMA_EN_DMA3_SEL_SHIFT (24U)
#define PWMV2_DMA_EN_DMA3_SEL_SET(x) (((uint32_t)(x) << PWMV2_DMA_EN_DMA3_SEL_SHIFT) & PWMV2_DMA_EN_DMA3_SEL_MASK)
#define PWMV2_DMA_EN_DMA3_SEL_GET(x) (((uint32_t)(x) & PWMV2_DMA_EN_DMA3_SEL_MASK) >> PWMV2_DMA_EN_DMA3_SEL_SHIFT)

/*
 * DMA2_EN (RW)
 *
 * enable dma2
 */
#define PWMV2_DMA_EN_DMA2_EN_MASK (0x800000UL)
#define PWMV2_DMA_EN_DMA2_EN_SHIFT (23U)
#define PWMV2_DMA_EN_DMA2_EN_SET(x) (((uint32_t)(x) << PWMV2_DMA_EN_DMA2_EN_SHIFT) & PWMV2_DMA_EN_DMA2_EN_MASK)
#define PWMV2_DMA_EN_DMA2_EN_GET(x) (((uint32_t)(x) & PWMV2_DMA_EN_DMA2_EN_MASK) >> PWMV2_DMA_EN_DMA2_EN_SHIFT)

/*
 * DMA2_SEL (RW)
 *
 * selelct one of compare point(0~23) or one reload point(24~27) as dma0
 */
#define PWMV2_DMA_EN_DMA2_SEL_MASK (0x1F0000UL)
#define PWMV2_DMA_EN_DMA2_SEL_SHIFT (16U)
#define PWMV2_DMA_EN_DMA2_SEL_SET(x) (((uint32_t)(x) << PWMV2_DMA_EN_DMA2_SEL_SHIFT) & PWMV2_DMA_EN_DMA2_SEL_MASK)
#define PWMV2_DMA_EN_DMA2_SEL_GET(x) (((uint32_t)(x) & PWMV2_DMA_EN_DMA2_SEL_MASK) >> PWMV2_DMA_EN_DMA2_SEL_SHIFT)

/*
 * DMA1_EN (RW)
 *
 * enable dma1
 */
#define PWMV2_DMA_EN_DMA1_EN_MASK (0x8000U)
#define PWMV2_DMA_EN_DMA1_EN_SHIFT (15U)
#define PWMV2_DMA_EN_DMA1_EN_SET(x) (((uint32_t)(x) << PWMV2_DMA_EN_DMA1_EN_SHIFT) & PWMV2_DMA_EN_DMA1_EN_MASK)
#define PWMV2_DMA_EN_DMA1_EN_GET(x) (((uint32_t)(x) & PWMV2_DMA_EN_DMA1_EN_MASK) >> PWMV2_DMA_EN_DMA1_EN_SHIFT)

/*
 * DMA1_SEL (RW)
 *
 * selelct one of compare point(0~23) or one reload point(24~27) as dma0
 */
#define PWMV2_DMA_EN_DMA1_SEL_MASK (0x1F00U)
#define PWMV2_DMA_EN_DMA1_SEL_SHIFT (8U)
#define PWMV2_DMA_EN_DMA1_SEL_SET(x) (((uint32_t)(x) << PWMV2_DMA_EN_DMA1_SEL_SHIFT) & PWMV2_DMA_EN_DMA1_SEL_MASK)
#define PWMV2_DMA_EN_DMA1_SEL_GET(x) (((uint32_t)(x) & PWMV2_DMA_EN_DMA1_SEL_MASK) >> PWMV2_DMA_EN_DMA1_SEL_SHIFT)

/*
 * DMA0_EN (RW)
 *
 * enable dma0
 */
#define PWMV2_DMA_EN_DMA0_EN_MASK (0x80U)
#define PWMV2_DMA_EN_DMA0_EN_SHIFT (7U)
#define PWMV2_DMA_EN_DMA0_EN_SET(x) (((uint32_t)(x) << PWMV2_DMA_EN_DMA0_EN_SHIFT) & PWMV2_DMA_EN_DMA0_EN_MASK)
#define PWMV2_DMA_EN_DMA0_EN_GET(x) (((uint32_t)(x) & PWMV2_DMA_EN_DMA0_EN_MASK) >> PWMV2_DMA_EN_DMA0_EN_SHIFT)

/*
 * DMA0_SEL (RW)
 *
 * selelct one of compare point(0~23) or one reload point(24~27) as dma0
 */
#define PWMV2_DMA_EN_DMA0_SEL_MASK (0x1FU)
#define PWMV2_DMA_EN_DMA0_SEL_SHIFT (0U)
#define PWMV2_DMA_EN_DMA0_SEL_SET(x) (((uint32_t)(x) << PWMV2_DMA_EN_DMA0_SEL_SHIFT) & PWMV2_DMA_EN_DMA0_SEL_MASK)
#define PWMV2_DMA_EN_DMA0_SEL_GET(x) (((uint32_t)(x) & PWMV2_DMA_EN_DMA0_SEL_MASK) >> PWMV2_DMA_EN_DMA0_SEL_SHIFT)

/* Bitfield definition for register of struct array CNT: CFG0 */
/*
 * RLD_CMP_SEL1 (RW)
 *
 * select one compare point from 24, set to 0x1F to disable current selection, used for reload value, compare value, force value update
 */
#define PWMV2_CNT_CFG0_RLD_CMP_SEL1_MASK (0x1F000000UL)
#define PWMV2_CNT_CFG0_RLD_CMP_SEL1_SHIFT (24U)
#define PWMV2_CNT_CFG0_RLD_CMP_SEL1_SET(x) (((uint32_t)(x) << PWMV2_CNT_CFG0_RLD_CMP_SEL1_SHIFT) & PWMV2_CNT_CFG0_RLD_CMP_SEL1_MASK)
#define PWMV2_CNT_CFG0_RLD_CMP_SEL1_GET(x) (((uint32_t)(x) & PWMV2_CNT_CFG0_RLD_CMP_SEL1_MASK) >> PWMV2_CNT_CFG0_RLD_CMP_SEL1_SHIFT)

/*
 * RLD_CMP_SEL0 (RW)
 *
 * select one compare point from 24, set to 0x1F to disable current selection
 */
#define PWMV2_CNT_CFG0_RLD_CMP_SEL0_MASK (0x1F0000UL)
#define PWMV2_CNT_CFG0_RLD_CMP_SEL0_SHIFT (16U)
#define PWMV2_CNT_CFG0_RLD_CMP_SEL0_SET(x) (((uint32_t)(x) << PWMV2_CNT_CFG0_RLD_CMP_SEL0_SHIFT) & PWMV2_CNT_CFG0_RLD_CMP_SEL0_MASK)
#define PWMV2_CNT_CFG0_RLD_CMP_SEL0_GET(x) (((uint32_t)(x) & PWMV2_CNT_CFG0_RLD_CMP_SEL0_MASK) >> PWMV2_CNT_CFG0_RLD_CMP_SEL0_SHIFT)

/*
 * RLD_TRIG_SEL (RW)
 *
 * select one trigger from 8, should set to pulse in trig_mux
 */
#define PWMV2_CNT_CFG0_RLD_TRIG_SEL_MASK (0x7000U)
#define PWMV2_CNT_CFG0_RLD_TRIG_SEL_SHIFT (12U)
#define PWMV2_CNT_CFG0_RLD_TRIG_SEL_SET(x) (((uint32_t)(x) << PWMV2_CNT_CFG0_RLD_TRIG_SEL_SHIFT) & PWMV2_CNT_CFG0_RLD_TRIG_SEL_MASK)
#define PWMV2_CNT_CFG0_RLD_TRIG_SEL_GET(x) (((uint32_t)(x) & PWMV2_CNT_CFG0_RLD_TRIG_SEL_MASK) >> PWMV2_CNT_CFG0_RLD_TRIG_SEL_SHIFT)

/*
 * RLD_UPDATE_TIME (RW)
 *
 * define when to use the calculation output value as reload time
 * 00:  software set work_ctrl1.shadow_lock bit
 * 01:  use compare point selected by rld_cmp_sel0 or rld_cmp_sel1
 * 10:  counter reload time
 * 11:  use rld_trig_sel to select one of the input trigger
 * NOTE: 00 is not recommended since the update time is not controllable, may cause error in complex application.
 */
#define PWMV2_CNT_CFG0_RLD_UPDATE_TIME_MASK (0x300U)
#define PWMV2_CNT_CFG0_RLD_UPDATE_TIME_SHIFT (8U)
#define PWMV2_CNT_CFG0_RLD_UPDATE_TIME_SET(x) (((uint32_t)(x) << PWMV2_CNT_CFG0_RLD_UPDATE_TIME_SHIFT) & PWMV2_CNT_CFG0_RLD_UPDATE_TIME_MASK)
#define PWMV2_CNT_CFG0_RLD_UPDATE_TIME_GET(x) (((uint32_t)(x) & PWMV2_CNT_CFG0_RLD_UPDATE_TIME_MASK) >> PWMV2_CNT_CFG0_RLD_UPDATE_TIME_SHIFT)

